Revit 2024 API
IFCExtrusionCalculatorUtils Class
 A utility class used to calculate extrusion data from Revit geometry for IFC export.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static class IFCExtrusionCalculatorUtils
Visual Basic
Public NotInheritable Class IFCExtrusionCalculatorUtils
Visual C++
public ref class IFCExtrusionCalculatorUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorUtils
See Also
IFCExtrusionCalculatorUtils Members
Autodesk.Revit.DB.IFC Namespace